ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/FSIRX0_CFG.xml
	<register id="CFG_RX_DMA_CTRL" acronym="CFG_RX_DMA_CTRL" offset="0x10" width="16" description="Receive DMA event control register. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="DMA_EVT_EN" width="1" begin="0" end="0" resetval="0x0" description="DMA Event Enable bitThis bit will enable a DMA Event to be generated upon the completion of a frame reception. 0h [R/W] = A DMA event will not be generated.1h [R/W] = A DMA event will be generated upon the reception of a frame. Note: The DMA event will only be generated for data frames." range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_Reserved_5" acronym="CFG_Reserved_5" offset="0x12" width="16" description="">
		
	</register>
	<register id="CFG_RX_EVT_STS_ALT1_" acronym="CFG_RX_EVT_STS_ALT1_" offset="0x14" width="16" description="Receive event and error status flag register">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match FlagThis bit indicates that an error frame was received with a  tag comparison matching the masked tag reference. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = No  tag-matched error frame received.1h [R] = A  tag-matched error frame has been received. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="14" rwaccess="R"/> 
		<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match FlagThis bit indicates that a dataframe was received with a  tag comparison matching the masked tag reference. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = No tag-matched data frame received.1h [R] = A tag-matched data frame has been received. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="13" rwaccess="R"/> 
		<bitfield id="PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Ping Tag Match FlagThis bit indicates that a ping frame was received with a  tag comparison matching the masked tag reference. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = No tag-matched ping frame received.1h [R] = A tag-matched ping frame has been received. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="12" rwaccess="R"/> 
		<bitfield id="DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Data Frame Received FlagThis bit indicates that an data frame has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = No data frame has been received.1h [R] = A data frame has been received. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="11" rwaccess="R"/> 
		<bitfield id="FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Frame Overrun FlagThis bit indicates that a frame overrun condition has occured. This bit gets set to 1 when a new DATA/ERROR frame is received and the corresponding DATA_FRAME_RCVD/ERROR_FRAME_RCVD flag is still set to 1. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = Frame overrun has not ocurred.1h [R] = Frame overrun has ocurred. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="10" rwaccess="R"/> 
		<bitfield id="PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Ping Frame Received FlagThis bit indicates that an ping frame has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = No ping frame has been received.1h [R] = A ping frame has been received. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="9" rwaccess="R"/> 
		<bitfield id="ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Error Frame Received FlagThis bit indicates that an error frame has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = No error frame has been received.1h [R] = An error frame has been received. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="8" rwaccess="R"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Receive Buffer Underrun FlagThis bit indicates that a buffer underrun condition has occured in the receive buffer. This will happen when software reads the buffer which is empty and has no valid data. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = Receive Buffer Underrun has not ocurred.1h [R] = Receive Buffer Underrun has ocurred. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="7" rwaccess="R"/> 
		<bitfield id="FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Frame Done FlagThis bit indicates that a frame has been successfully received without error. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = No frame has been successfully received.1h [R] = A frame has been successfully received. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="6" rwaccess="R"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Receive Buffer Overrun FlagThis bit indicates that a buffer overrun condition has occured in the receive buffer. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = Receive buffer overrun has not ocurred.1h [R] = Receive buffer overrun has ocurred. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="5" rwaccess="R"/> 
		<bitfield id="EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="End-of-Frame Error FlagThis bit indicates that an invalid end-of-frame bit pattern has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = Invalid end-of-frame has not been received.1h [R] = Invalid end-of-frame has been received To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="4" rwaccess="R"/> 
		<bitfield id="TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Frame Type Error FlagThis bit inditcates that an invalid frame type has been received. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = Invalid frame type has not been received.1h [R] = Invalid frame type has been received To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="3" rwaccess="R"/> 
		<bitfield id="CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="CRC Error FlagThis bit indicates that a CRC error has occured. A CRC error will be generated on a data frame where the received CRC and the computed CRC do not match. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = CRC error has not occured.1h [R] = CRC error has occured. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="2" rwaccess="R"/> 
		<bitfield id="FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Timeout FlagThis bit indicates that the frame watchdog timer has timed out. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = Frame watchdog timeout has not occured.1h [R] = Frame watchdog timeout has occured. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="1" rwaccess="R"/> 
		<bitfield id="PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Timeout FlagThis bit indicates that the ping watchdog timer has timed out. Software can also force this bit to get set by writing to the RX_EVT_FRC register.  0h [R] = Ping watchdog timeout has not occured.1h [R] = Ping watchdog timeout has occured. To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="0" rwaccess="R"/>
	</register>
	<register id="CFG_RX_CRC_INFO" acronym="CFG_RX_CRC_INFO" offset="0x16" width="16" description="Receive CRC info of received and computed CRC">
		<bitfield id="CALC_CRC" width="8" begin="15" end="8" resetval="0x0" description="Harware Calculated CRC ValueThis bitfield contains the CRC value that was calculated on the last received data. The contents of this bitfield are valid only when data frames are received.  Note: The contents of this bitfield are invalid for ping and error frames." range="15 - 8" rwaccess="R"/> 
		<bitfield id="RX_CRC" width="8" begin="7" end="0" resetval="0x0" description="Received CRC ValueThis bitfield contains the CRC value that was last received a frame. The contents of this bitfield are valid only when data frames are received.  Note: The contents of this bitfield are invalid for ping and error frames." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_RX_EVT_CLR_ALT1_" acronym="CFG_RX_EVT_CLR_ALT1_" offset="0x18" width="16" description="Receive event and error clear register">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match Glag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="14" rwaccess="W"/> 
		<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="13" rwaccess="W"/> 
		<bitfield id="PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Ping Tag Match Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="12" rwaccess="W"/> 
		<bitfield id="DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Data Frame Received Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="11" rwaccess="W"/> 
		<bitfield id="FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Frame Overrun Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="10" rwaccess="W"/> 
		<bitfield id="PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Ping Frame Received Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="9" rwaccess="W"/> 
		<bitfield id="ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Error Frame Received Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="8" rwaccess="W"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Receive Buffer Underrun Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [R/W] = Writing a 0 to this bit will have no effect.1h [R/W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="7" rwaccess="W"/> 
		<bitfield id="FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Frame Done Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="6" rwaccess="W"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Receive Buffer Overrun Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="5" rwaccess="W"/> 
		<bitfield id="EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="End-of-Frame Error Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="4" rwaccess="W"/> 
		<bitfield id="TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Frame Type Error Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="3" rwaccess="W"/> 
		<bitfield id="CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="CRC Error Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="2" rwaccess="W"/> 
		<bitfield id="FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Timeout Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="1" rwaccess="W"/> 
		<bitfield id="PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Timeout Flag Clear bitThis bit clears the corresponding bit in the RX_EVT_STS register. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="0" rwaccess="W"/>
	</register>
	<register id="CFG_RX_EVT_FRC_ALT1_" acronym="CFG_RX_EVT_FRC_ALT1_" offset="0x1A" width="16" description="Receive event and error flag force register">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="14" rwaccess="W"/> 
		<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="13" rwaccess="W"/> 
		<bitfield id="PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Ping Tag Match Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="12" rwaccess="W"/> 
		<bitfield id="DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Data Frame Received Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="11" rwaccess="W"/> 
		<bitfield id="FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Frame Overrun Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="10" rwaccess="W"/> 
		<bitfield id="PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Ping Frame Received Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="9" rwaccess="W"/> 
		<bitfield id="ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Error Frame Received Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="8" rwaccess="W"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Receive Buffer Underrun Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="7" rwaccess="W"/> 
		<bitfield id="FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Frame Done Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="6" rwaccess="W"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Receive Buffer Overrun Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="5" rwaccess="W"/> 
		<bitfield id="EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="End-of-Frame Error Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="4" rwaccess="W"/> 
		<bitfield id="TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Frame Type Error Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="3" rwaccess="W"/> 
		<bitfield id="CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="CRC Error Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="2" rwaccess="W"/> 
		<bitfield id="FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Timeout Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="1" rwaccess="W"/> 
		<bitfield id="PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Timeout Flag Force bitThis bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR. 0h [W] = Writing a 0 to this bit will have no effect.1h [W] = Force the corresponding bit in the RX_EVT_STS Register." range="0" rwaccess="W"/>
	</register>
	<register id="CFG_RX_BUF_PTR_LOAD" acronym="CFG_RX_BUF_PTR_LOAD" offset="0x1C" width="16" description="Receive buffer pointer load register">
		<bitfield id="BUF_PTR_LOAD" width="4" begin="3" end="0" resetval="0x0" description="Buffer Pointer Load.This is the value to be loaded into the receive word pointer when written. This is to allow software to force the receiver to start storing the received data starting at a specific location in the buffer.  NOTE: The value of the CURR_BUF_PTR in the RX_BUF_PTR_STS will not get reflected immediately. This will take effect only when there is a valid receive operation with incoming clocks after [3 RXCLK + 3 SYCLK] cycles." range="3 - 0" rwaccess="R/W"/>
	</register>
